Question 1

In [1]:
import pandas as pd

In [2]:
# 1. read_csv()
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
# It reads the csv file

In [3]:
# 2. head()
df.head()
# It gives the first five input of the file

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# 3. dtypes
df.dtypes
# It give us the datatype of column

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [5]:
# 4. describe()
df.describe()
# It give us the statistical analysis of numerical columns

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
# 5. columns
df.columns
# It give us the name of columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Question 2

In [7]:
df = pd.DataFrame({"A":[10,23,32,32,12,53,22,54,21,45,21,54],"B":[15,22,34,23,55,98,33,88,54,78,55,32],"C":[11,23,31,33,55,32,46,36,54,26,36,25]})
print(df,'\n')
df1 = df.iloc[1::2]
print(df1)

     A   B   C
0   10  15  11
1   23  22  23
2   32  34  31
3   32  23  33
4   12  55  55
5   53  98  32
6   22  33  46
7   54  88  36
8   21  54  54
9   45  78  26
10  21  55  36
11  54  32  25

     A   B   C
1   23  22  23
3   32  23  33
5   53  98  32
7   54  88  36
9   45  78  26
11  54  32  25

Question 3

In [8]:
df = pd.DataFrame({"Values":[1,2,3,4,5]})
num = df["Values"]
num1 = num[0:3]
sum = 0
for i in num1:
    sum = sum + i
print("Sum of first three values of the column",sum)

Sum of first three values of the column 6

Question 4

In [9]:
df = pd.DataFrame({"Text":["She Seated","He was walking","Sita is reading a book","Akshay is running in the playground"]})
sen = df["Text"]
l = []
for i in sen:
    c = len(i.split())
    l.append(c)
df["Word_Count"] = l
df

                                  Text  Word_Count
0                           She Seated           2
1                       He was walking           3
2               Sita is reading a book           5
3  Akshay is running in the playground           6

Question 5

DataFrame.size is use to get the number of elements in the dataframe which is no. of rows * no. of columns which is total no. of elements while DataFrame.shape returns a tuple containing no. of rows and no. of columns separately.

In [10]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

print(df.size)
print(df.shape)

10692
(891, 12)

Question 6

pandas.read_excel() function is use to read an excel file.

Question 7

In [11]:
df = pd.DataFrame({"Email":["saksham@gmail.com", 'anurag101@gmail.com', 'abhi_23@gmail.com', 'anuradha_one@gmail.com']})

In [12]:
email  = df['Email']
l = []
for i in email:
    a  = i.split("@")
    l.append(a[0])
df['Username'] = l
df

                    Email      Username
0       saksham@gmail.com       saksham
1     anurag101@gmail.com     anurag101
2       abhi_23@gmail.com       abhi_23
3  anuradha_one@gmail.com  anuradha_one

Question 8

In [13]:
df = pd.DataFrame({"A":[4,8,9,5,2], "B":[4,7,2,8,9], "C":[6,4,8,2,9]})
print(df,'\n')
df1 = df[(df['A'] > 5) & (df['B'] < 10)]
print(df1)

   A  B  C
0  4  4  6
1  8  7  4
2  9  2  8
3  5  8  2
4  2  9  9

   A  B  C
1  8  7  4
2  9  2  8

Question 9

In [14]:
df = pd.DataFrame({'Values':[344,221,234,211,234,854,356]})
df

   Values
0     344
1     221
2     234
3     211
4     234
5     854
6     356

In [15]:
print(df.mean())

Values    350.571429
dtype: float64

In [16]:
print(df.median())

Values    234.0
dtype: float64

In [17]:
print(df.std())

Values    229.840421
dtype: float64

Question 10

In [18]:
d = pd.date_range('2023-01-01', periods = 16, freq='D')
s = [125,654,332,112,298,422,532,333,621,402,124,235,675,347,853,268]
df = pd.DataFrame({"Sales":s, "Date":d})
df["MovingAverage"] = df["Sales"].rolling(window=7).mean()
df

    Sales       Date  MovingAverage
0     125 2023-01-01            NaN
1     654 2023-01-02            NaN
2     332 2023-01-03            NaN
3     112 2023-01-04            NaN
4     298 2023-01-05            NaN
5     422 2023-01-06            NaN
6     532 2023-01-07     353.571429
7     333 2023-01-08     383.285714
8     621 2023-01-09     378.571429
9     402 2023-01-10     388.571429
10    124 2023-01-11     390.285714
11    235 2023-01-12     381.285714
12    675 2023-01-13     417.428571
13    347 2023-01-14     391.000000
14    853 2023-01-15     465.285714
15    268 2023-01-16     414.857143

Question 11

In [19]:
df = pd.DataFrame({"Date":['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [20]:
df['Weekday'] = ["Sunday", "Monday", "Tuesday", "Wednesday", "Thursday"]
df

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

Question 12

In [21]:
d = pd.date_range('2023-01-01', periods = 31, freq='D')
df = pd.DataFrame({'Date':d})
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

Question 13

pandas library is needed to import to use basic functions of pandas.